#include <iostream>

using namespace std;

void main()
{
	//1. 数据类型 数组名[行数][列数]；
	int arr1[2][3];
	
	arr1[0][0] = 1;
	arr1[0][1] = 2;
	arr1[0][2] = 3;
	arr1[1][0] = 4;
	arr1[1][1] = 5;
	arr1[1][2] = 6;

	cout << "------数据类型 数组名[行数][列数]------" << endl << "\t";
	for (int a = 0; a < 2; a++)
	{
		for (int a1 = 0; a1 < 3; a1++)
		{
			cout << arr1[a][a1] << " ";
		}
	}
	cout << endl;

	//2. 数据类型 数组名[行数][列数] = {｛数据1，数据2｝，｛数据3，数据4｝}；
	int arr2[2][3] =
	{
		{1, 2, 3},
		{4, 5, 6}
	};

	cout << "------数据类型 数组名[行数][列数] = {｛数据1，数据2｝，｛数据3，数据4｝}------" << endl << "\t";
	for (int b = 0; b < 2; b++)
	{
		for (int b1 = 0; b1 < 3; b1++)
		{
			cout << arr2[b][b1] << " ";
		}
	}
	cout << endl;

	//3. 数据类型 数组名[行数][列数] = ｛数据1，数据2，数据3，数据4｝；
	int arr3[2][3] = { 1, 2, 3, 4, 5, 6 };

	cout << "------数据类型 数组名[行数][列数] = ｛数据1，数据2，数据3，数据4｝------" << endl << "\t";
	for (int c = 0; c < 2; c++)
	{
		for (int c1 = 0; c1 < 3; c1++)
		{
			cout << arr3[c][c1] << " ";
		}
	}
	cout << endl;

	//4. 数据类型 数组名[][列数] = ｛数据1，数据2，数据3，数据4｝；
	int arr4[][3] = { 1, 2, 3, 4, 5, 6 };

	cout << "------数据类型 数组名[][列数] = ｛数据1，数据2，数据3，数据4｝------" << endl << "\t";
	for (int d = 0; d < 2; d++)
	{
		for (int d1 = 0; d1 < 3; d1++)
		{
			cout << arr4[d][d1] << " ";
		}
	}
	cout << endl;
}
